# Trabajo final

En cada celda de código se explica mediante comentarios qué hacer y cómo. 

Respetad los huecos entre comentarios para rellenar con código lo que se pide justo debajo de cada comentario.

1. Consulta y filtrado de valores nulos (1 puntos)
2. Consultas con Query (2.5 puntos)
3. Consultas indexación booleana (1 punto)
3. Discretización y Variables dummies (1.5 puntos)
4. Union de datasets, agrupamiento y más consultas con grupos (3 puntos)
6. Consultas libres (1 puntos)

## 1 Carga modificación y filtrado de nulos

In [1]:
import pandas as pd

# importar medallas_jjoo.csv
medallas = pd.read_csv("medallas_jjoo.csv")

# muestra el tamaño del dataset
print(medallas.shape)   

# mostrar las primeras filas de medallas para comprender su estructura y comprobar la importación
medallas.head()

(1344, 8)

,Year,Host_country,Host_city,Country_Name,Country_Code,Gold,Silver,Bronze
0,1896,Greece,Athens,Great Britain,GBR,2,3,2
1,1896,Greece,Athens,Hungary,HUN,2,1,3
2,1896,Greece,Athens,France,FRA,5,4,2
3,1896,Greece,Athens,United States,USA,11,7,2
4,1896,Greece,Athens,Germany,GER,6,5,2

In [2]:
# comprobar los si existen valores nulos, cuántos son y en qué columnas
medallas.isnull().sum()

Year             0
Host_country     0
Host_city        0
Country_Name     0
Country_Code    86
Gold             0
Silver           0
Bronze           0
dtype: int64

In [4]:
# Vamos a eliminar la columna country_code que además es la que tiene nulos
medallas = medallas.drop(columns=['Country_Code'])


# Las columnas son renombradas a españo: año, host_pais, host_ciudad, pais, oro, plata bronce
# host se refiere a la ciudad o pais organizador de los juegos
medallas.columns = ['año', 'host_pais', 'host_ciudad', 'pais', 'oro', 'plata', 'bronce']


# mostramos las primeras filas para comprobar que la eliminación y renombrado de columnas ha sido correcto
medallas.head()

    año host_pais host_ciudad           pais  oro  plata  bronce
0  1896    Greece      Athens  Great Britain    2      3       2
1  1896    Greece      Athens        Hungary    2      1       3
2  1896    Greece      Athens         France    5      4       2
3  1896    Greece      Athens  United States   11      7       2
4  1896    Greece      Athens        Germany    6      5       2

In [5]:
# Comprueba si existen filas duplicadas
medallas.duplicated().sum()

np.int64(0)

## 2. Consultas query 
Realiza las consultas de cada comentario utilizando query. 

Algunas necesitarán alguna acción más, como filtrar una columna y alguna operación, ordenar valores, etc.

In [6]:
# Consulta 1: Mostrar el número y tipo de medallas España en los JJOO de Barcelona 1992
medallas.query("año == 1992 and host_ciudad == 'Barcelona' and pais == 'Spain'")

      año host_pais host_ciudad   pais  oro  plata  bronce
711  1992     Spain   Barcelona  Spain   13      7       2

In [ ]:
# Consulta 2: Mostrar cuántas medallas de oro ha ganado españa en toda la historia
medallas.query("pais == 'Spain'")['oro'].sum()

In [7]:
# Consulta 3: Mostrar el medallero de Atenas 2004 de forma descendente en columna medallas de oro.
medallas_atenas_2004 = medallas.query("año == 2004 and host_ciudad == 'Athens'")
medallas_atenas_2004_sorted = medallas_atenas_2004.sort_values(by='oro', ascending=False)
medallas_atenas_2004_sorted

      año host_pais host_ciudad                 pais  oro  plata  bronce
939  2004    Greece      Athens        United States   36     39      26
942  2004    Greece      Athens                China   32     17      14
941  2004    Greece      Athens               Russia   28     26      36
936  2004    Greece      Athens            Australia   17     16      17
935  2004    Greece      Athens                Japan   16      9      12
..    ...       ...         ...                  ...  ...    ...     ...
960  2004    Greece      Athens               Mexico    0      3       1
964  2004    Greece      Athens             Colombia    0      0       2
965  2004    Greece      Athens                India    0      1       0
966  2004    Greece      Athens             Paraguay    0      1       0
967  2004    Greece      Athens  Trinidad and Tobago    0      0       1

[74 rows x 7 columns]

In [8]:
# Consulta 4: ¿Cuántas veces se han celebrado los JJOO en Francia? Mostrar solamente el número con un mensaje.
num_jjoo_francia = medallas.query("host_pais == 'France'")['año'].nunique()
print(f"Los JJOO se han celebrado en Francia {num_jjoo_francia} veces.")

Los JJOO se han celebrado en Francia 2 veces.

In [9]:
# Consulta 5: Mostrar las filas de los paises 'Spain', 'France', 'Germany', 'Italy',  que han ganado más de 10 medallas de oro
medallas_europa_oro = medallas[medallas['pais'].isin(['Spain', 'France', 'Germany', 'Italy'])]
medallas_europa_oro_filtered = medallas_europa_oro[medallas_europa_oro['oro'] > 10]
medallas_europa_oro_filtered

       año      host_pais     host_ciudad     pais  oro  plata  bronce
16    1900         France           Paris   France   27     38      37
102   1920        Belgium         Antwerp    Italy   13      5       5
112   1924         France           Paris   France   13     15      10
174   1932  United States     Los Angeles    Italy   12     12      12
203   1936        Germany          Berlin  Germany   33     26      30
355   1960          Italy            Rome    Italy   13     10      13
608   1984  United States     Los Angeles    Italy   14      6      12
711   1992          Spain       Barcelona    Spain   13      7       2
718   1992          Spain       Barcelona  Germany   33     21      28
780   1996  United States         Atlanta    Italy   13     10      12
783   1996  United States         Atlanta   France   15      7      15
787   1996  United States         Atlanta  Germany   20     18      27
856   2000      Australia          Sydney    Italy   13      8      13
857   2000      Australia          Sydney   France   13     14      11
860   2000      Australia          Sydney  Germany   13     17      26
937   2004         Greece          Athens   France   11      9      13
938   2004         Greece          Athens  Germany   13     16      20
1022  2008          China         Beijing  Germany   16     11      14
1101  2012  Great Britain          London   France   11     11      13
1102  2012  Great Britain          London  Germany   11     20      13
1188  2016         Brazil  Rio de Janeiro  Germany   17     10      15

## 3. Indexación booleana

Replica las consultas 3 y 5 del apartado 2, pero usando indexación booleana en lugar de usar query.

In [ ]:
# Consulta 3

In [ ]:
# Consulta 5

## 4. Discretización y variable dummy

In [10]:
# Copia el dataframe medallas en medallas2 para trabajar con el

In [11]:
# Genera una nueva columna que sea "puntuacion" asignando:
    # 3 puntos a cada medalla de oro
    # 2 puntos a cada medalla de plata
    # 1 punto a cada medalla de bronce





# muestra las primeras filas para comprobar que la nueva columna ha sido creada correctamente

In [12]:
# Discretización: Crea una nueva columna "puntuacion_categoria" que divida la puntuación en 3 categorías: baja, media y alta
# Puedes utilizar qcut para generar intervalos de forma equitativa




# muestra las primeras filas para comprobar que la nueva columna ha sido creada correctamente

In [13]:
# Crea un dataframe "dummydf" con variables dummies para la columna puntuacion_categoria con el prefijo "puntos"




# añade las variables dummy al dataframe medallas2 con join 



# Muestra las primeras filas para comprobar que las variables dummies han sido creadas correctamente

## 5. Union de datasets y consultas con agrupamiento

+ Cada consulta es 0.6 puntos. 
+ La unión de ambos datasets es 1.2 puntos.

In [14]:
# Consulta 1: Usando agrupamiento, mostrar el número total de medallas de oro, plata y bronce de cada país

In [15]:
# Importa el dataset paises.csv en el dataframe paises
# Este csv contiene información sobre la población y el PIB per capita de paises, 
    # además del continente y subregion al que pertenecen. 



# muestra las primeras filas para comprender su estructura y comprobar la importación

In [16]:
# Compruba que no haya nulos es el dataframe paises.

In [17]:
# Consulta 2: Con agrupamiento, a partir de dataset paises, consultar la media del PIB y poblacición de cada región

In [18]:
# Une los dataframes medallas y paises en un nuevo dataframe llamado medallas_paises usando la columna pais
# Debes hacer un merge interno.



# muestra las primeras filas para comprobar que la unión ha sido correcta

In [19]:
# Comprueba que no existan nulos en el dataframe medallas_paises. Si los hay, quizás tienes el ejercicio mal.

In [20]:
# Consulta 3: Mostrar el número total de medallas de oro, plata y bronce de cada región, 
    # pero solamente de las regiones con más de 300 medallas de oro
    # La salida debe ser ordenada de forma descentende según el número de medallas de oro

## 6. Consultas libres

Realiza 2 consultas adicionales y diferentes a las anteriores, usando query o indexación booleana, que tengan además el uso de  agrupamiento y funciones de agregación y/o creación de intervalos. 

Las consultas se deben hacer sobre el dataset resultante de la unión de ambos csv realizada en el punto 4.

La nota dependerá de la complejidad de la consulta.

In [ ]:
# Consulta 1

In [ ]:
# Consulta 2